cylinderScouring/scour_tutorial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            ("libOpenFOAM.so" "libfieldFunctionObjects.so");

application     pimpleFoam;

startFrom       latestTime; //startTime; 

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.08;

writeControl    runTime;

writeInterval   0.08;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    shearStress
    {
        functionObjectLibs ("libfieldFunctionObjects.so");
        type            wallShearStress;
        writeInterval   1;
        patches         ("walls");
     }
 forces_cylinder1
    {
        type forces;
        libs ( "libforces.so" );
        patches (cylinder1);
        rho     rhoInf;
        rhoInf  998.8;
        log     on;
        writeControl   timeStep;
        writeInterval  1;
        CofR (2.929541 0 0.2);
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs ( "libforces.so" );
        writeControl   timeStep;
        writeInterval  1;
        patches         ( cylinder1 );
        rho             rhoInf;
        log             true;
        rhoInf          1;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0.72 0 0);
        pitchAxis       (0 1 0);
        magUInf         20;
        lRef            1.42;
        Aref            0.75;
    }
}
// ************************************************************************* //

